/* Bounded PL/I-to-DB2 static write reference fixture. */
AUTHUPD1: PROC OPTIONS(MAIN);
  DCL AUTH_ID CHAR(16) INIT('4000000000000001');
  DCL FRAUD_FLAG CHAR(1) INIT('Y');

  EXEC SQL
    UPDATE CARDDEMO.AUTHFRDS
       SET AUTH_FRAUD = :FRAUD_FLAG
     WHERE CARD_NUM = :AUTH_ID;

END AUTHUPD1;
