AUTHDB   DBD   NAME=AUTHDB,ACCESS=(HIDAM,OSAM)
AUTHDS   DATASET DD1=AUTHDD
AUTHROOT SEGM  NAME=AUTHROOT,PARENT=0,BYTES=80
AUTHID   FIELD NAME=AUTHID,BYTES=11,START=1,TYPE=P
AUTHCHLD SEGM  NAME=AUTHCHLD,PARENT=AUTHROOT,BYTES=32
STATUS   FIELD NAME=STATUS,BYTES=1,START=1,TYPE=C
         DBDGEN
         FINISH
         END
