AUTHPCB  PCB   TYPE=DB,DBDNAME=AUTHDB,PROCOPT=G
         SENSEG NAME=AUTHROOT,PARENT=0
         SENSEG NAME=AUTHCHLD,PARENT=AUTHROOT
         PSBGEN PSBNAME=AUTHPSB,LANG=COBOL
         END
