       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCOUNTV.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY ACCTREC.
       PROCEDURE DIVISION.
           EXEC SQL
             SELECT AUTH_ID INTO :ACCT-ID
               FROM CARDDEMO.AUTHFRDS
           END-EXEC.
           CALL 'ACCTPL1' USING ACCT-ID.
           GOBACK.
