ACCTPL1: PROC(ACCT_ID) OPTIONS(MAIN);
  DCL ACCT_ID FIXED DECIMAL(11);
  DCL CBACT04C ENTRY OPTIONS(COBOL);
  EXEC SQL SELECT AUTH_ID INTO :ACCT_ID FROM CARDDEMO.AUTHFRDS;
  CALL CBACT04C(ACCT_ID);
END ACCTPL1;
