       01 BANK-RECORD.
          05 ENTRY-COUNT PIC 9(4) COMP.
          05 BALANCE PIC S9(9)V99 COMP-3.
          05 PAYLOAD PIC X(4).
          05 IDENTIFIER REDEFINES PAYLOAD PIC 9(9) COMP-5.
          05 ENTRIES OCCURS 0 TO 3 DEPENDING ON ENTRY-COUNT.
             10 AMOUNT PIC S9(3)V99 COMP-3.
          05 END-MARK PIC X.
