//ACCTPIL JOB (LIGHTYEAR),'SOURCE PILOT',CLASS=A,MSGCLASS=X
//RUN      EXEC PGM=ACCTPL1
//STEPLIB  DD DSN=CARDDEMO.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ACCTIN   DD DSN=CARDDEMO.PILOT.INPUT,DISP=SHR
