//JOB15    JOB (LIGHTYEAR),'ALLOCATION'
//RUN      EXEC PGM=IEFBR14
//OUT      DD DSN=CARDDEMO.FIXED,DISP=(NEW,CATLG,DELETE),
//         DCB=(RECFM=FB,LRECL=80),SPACE=(TRK,(5,2))
