DEFINE CLUSTER (NAME(CARDDEMO.AUTH.KSDS) -
  INDEXED KEYS(11 0) RECORDSIZE(80 80) -
  DATA(NAME(CARDDEMO.AUTH.KSDS.DATA)) -
  INDEX(NAME(CARDDEMO.AUTH.KSDS.INDEX)))
DEFINE ALTERNATEINDEX (NAME(CARDDEMO.AUTH.AIX) -
  RELATE(CARDDEMO.AUTH.KSDS) KEYS(16 11))
DEFINE PATH (NAME(CARDDEMO.AUTH.PATH) -
  PATHENTRY(CARDDEMO.AUTH.AIX))
