FILE12: PROC OPTIONS(MAIN);
  DCL INPUT_FILE FILE;
  DCL OUTPUT_FILE FILE;
  READ FILE(INPUT_FILE) INTO(RECORD);
  WRITE FILE(OUTPUT_FILE) FROM(RECORD);
END FILE12;
