COMMENT20: PROC OPTIONS(MAIN);
  /* CALL GHOST; EXEC SQL DELETE FROM SECRET.TABLE; */
  DCL TEXT CHAR(80) INIT('CALL GHOST; EXEC SQL DELETE FROM X;');
END COMMENT20;
