UNALIGNEDCASE: PROC OPTIONS(MAIN);
  DCL 1 REQUEST UNALIGNED,
        2 ACCOUNT CHAR(11),
        2 AMOUNT DECIMAL(12,2),
        2 FLAGS CHAR(3);
END UNALIGNEDCASE;
